Revit 2026 API

# PointCloudOverrideSettings(PointCloudOverrideSettings) Constructor

---

Constructs a copy of source object.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointCloudOverrideSettings(
	PointCloudOverrideSettings other
)
```
```vb
Public Sub New (
	other As PointCloudOverrideSettings
)
```
```cpp
public:
PointCloudOverrideSettings(
	PointCloudOverrideSettings^ other
)
```
```fsharp
new :
        other : PointCloudOverrideSettings -> PointCloudOverrideSettings
```

#### Parameters

other PointCloudOverrideSettings
     Source object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointCloudOverrideSettings Class

PointCloudOverrideSettings Overload

Autodesk.Revit.DB.PointClouds Namespace